FI/Ajanvaraustiedot/Integraatiopalvelu_Ajanvaraustiedot_Esimerkkisanoma_GetScheduleCommonData_Request_3.1.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lif="Lifecare.Integration.ScheduleDataService" xmlns:lif1="Lifecare.Integration.Common.Contracts" xmlns:lif2="Lifecare.Integration.ScheduleDataService.Contracts">
   <soapenv:Header/>
   <soapenv:Body>
      <lif:GetScheduleDataCommonRequest>
         <lif:MessageHeader>
               <lif1:MessageID>?</lif1:MessageID>
               <lif1:TransactionID>?</lif1:TransactionID>
               <lif1:SenderID>?</lif1:SenderID>
               <lif1:SenderApplication>?</lif1:SenderApplication>
               <lif1:ReceiverID>?</lif1:ReceiverID>
               <lif1:ReceiverApplication>?</lif1:ReceiverApplication>
               <lif1:CharacterSet>?</lif1:CharacterSet>
               <lif1:DataServiceURL>?</lif1:DataServiceURL>
               <lif1:UserLanguageCode>?</lif1:UserLanguageCode>
               <lif1:VersionNumber>?</lif1:VersionNumber>
         </lif:MessageHeader>
         <lif:Common>
               <lif1:ContractKey>aaaabbbbbcccccc</lif1:ContractKey>
               <lif1:CallingSystem>Keksi</lif1:CallingSystem>
               <lif1:Area>
                  <lif1:CodeSetName>?</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>?</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Area>
               <lif1:UserIdentifiers>
                  <lif1:UserIdentifier>
                     <lif1:UserIdentifierCodeId>EFFICA_USER_ID</lif1:UserIdentifierCodeId>
                     <lif1:UserIdentifierCode>tieto</lif1:UserIdentifierCode>
                     <lif1:FamilyName>?</lif1:FamilyName>
                     <lif1:GivenNames>?</lif1:GivenNames>
                     <lif1:Profession>?</lif1:Profession>
                  </lif1:UserIdentifier>
               </lif1:UserIdentifiers>
               <lif1:Function>
                  <lif1:CodeSetName>?</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>?</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Function>
               <lif1:ReasonCode>
                  <lif1:CodeSetName>?</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>?</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:ReasonCode>
         </lif:Common>
         <lif:ScheduleReq>
               <lif2:ScheduleId>
                  <lif1:CodeSetName>?</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>integr</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif2:ScheduleId>
               <lif2:Functions>
                  <lif1:Code>
                     <lif1:CodeSetName>?</lif1:CodeSetName>
                     <lif1:CodeSetId>?</lif1:CodeSetId>
                     <lif1:CodeValue>hammas</lif1:CodeValue>
                     <lif1:CodeDescription>?</lif1:CodeDescription>
                  </lif1:Code>
               </lif2:Functions>
               <lif2:Areas>
                  <lif1:Code>
                     <lif1:CodeSetName>?</lif1:CodeSetName>
                     <lif1:CodeSetId>?</lif1:CodeSetId>
                     <lif1:CodeValue>hhkes</lif1:CodeValue>
                     <lif1:CodeDescription>?</lif1:CodeDescription>
                  </lif1:Code>
               </lif2:Areas>
               <lif2:AppointmentTypes>
                  <lif1:Code>
                     <lif1:CodeSetName>?</lif1:CodeSetName>
                     <lif1:CodeSetId>?</lif1:CodeSetId>
                     <lif1:CodeValue></lif1:CodeValue>
                     <lif1:CodeDescription>?</lif1:CodeDescription>
                  </lif1:Code>
               </lif2:AppointmentTypes>
               <lif2:PatientId>
                  <lif2:Identifier>*</lif2:Identifier>
               </lif2:PatientId>
               <lif2:StatusCode>Booked</lif2:StatusCode>
               <lif2:RequestType>All</lif2:RequestType>
               <lif2:StartDateTime>2015-06-10T08:00:00</lif2:StartDateTime>
               <lif2:EndDateTime>2015-06-11T16:00:00</lif2:EndDateTime>
         </lif:ScheduleReq>
      </lif:GetScheduleDataCommonRequest>
   </soapenv:Body>
</soapenv:Envelope>